#language: ru

Функционал: Проверка функционала перепланирования доставки банковской карты

	@card-delivery-replanning @positive
	Структура сценария: Перепланирование доставки карты проходит успешно
		И данные пользователя подгружены из файла <file>
		Дано пользователь открыл главную страницу
		И загружена страница "Главная страница"
		Когда заполняются поля:
			| Город             | #{city}     |
			| Дата встречи      | <firstDate> |
			| ФИО               | #{name}     |
			| Мобильный телефон | #{phone}    |
		И выполнено нажатие на Согласие на обработку данных
		И выполнено нажатие на Запланировать
		Тогда загружено диалоговое окно "Оповещение об успехе"
		И выполнено нажатие на Закрыть
		И загружена страница "Главная страница"
		И поле Дата встречи заполняется значением <secondDate>
		И выполнено нажатие на Запланировать
		Тогда загружено диалоговое окно "Оповещение о перепланировании"
		И выполнено нажатие на Перепланировать
		И загружено диалоговое окно "Оповещение об успехе"
		И выполнено нажатие на Закрыть
		Примеры:
			| file                     | firstDate             | secondDate            |
			| GeneratedTestFile_0.json | #{now(dd.MM.yyyy)+3d} | #{now(dd.MM.yyyy)+4d} |
			| GeneratedTestFile_1.json | #{now(dd.MM.yyyy)+1M} | #{now(dd.MM.yyyy)+2M} |
			| GeneratedTestFile_2.json | #{now(dd.MM.yyyy)+1y} | #{now(dd.MM.yyyy)+2y} |

	@card-delivery-replanning @negative
	Структура сценария: Перепланирование доставки карты не происходит, если новая дата доставки раньше, чем текущая + 3 дня
		И данные пользователя подгружены из файла <file>
		Дано пользователь открыл главную страницу
		И загружена страница "Главная страница"
		Когда заполняются поля:
			| Город             | #{city}               |
			| Дата встречи      | #{now(dd.MM.yyyy)+3d} |
			| ФИО               | #{name}               |
			| Мобильный телефон | #{phone}              |
		И выполнено нажатие на Согласие на обработку данных
		И выполнено нажатие на Запланировать
		Тогда загружено диалоговое окно "Оповещение об успехе"
		И выполнено нажатие на Закрыть
		И загружена страница "Главная страница"
		И поле Дата встречи заполняется значением <date>
		И выполнено нажатие на Запланировать
		И поле Неподходящая дата видимо
		Примеры:
			| file                     | date                  |
			| GeneratedTestFile_3.json | #{now(dd.MM.yyyy)-1d} |
			| GeneratedTestFile_4.json | #{now(dd.MM.yyyy)}    |
			| GeneratedTestFile_5.json | #{now(dd.MM.yyyy)+1d} |
			| GeneratedTestFile_6.json | #{now(dd.MM.yyyy)+2d} |
			| GeneratedTestFile_7.json | #{now(dd.MM.yyyy)-1M} |
			| GeneratedTestFile_8.json | #{now(dd.MM.yyyy)-1y} |
			| GeneratedTestFile_9.json | 01.01.0001            |

	@card-delivery-replanning @negative
	Структура сценария: Перепланирование доставки карты не происходит, если новая дата доставки задана неверно
		И данные пользователя подгружены из файла <file>
		Дано пользователь открыл главную страницу
		И загружена страница "Главная страница"
		Когда заполняются поля:
			| Город             | #{city}               |
			| Дата встречи      | #{now(dd.MM.yyyy)+3d} |
			| ФИО               | #{name}               |
			| Мобильный телефон | #{phone}              |
		И выполнено нажатие на Согласие на обработку данных
		И выполнено нажатие на Запланировать
		Тогда загружено диалоговое окно "Оповещение об успехе"
		И выполнено нажатие на Закрыть
		И загружена страница "Главная страница"
		Когда поле Дата встречи заполняется значением <date>
		И выполнено нажатие на Запланировать
		И поле Неверно заданная дата видимо
		Примеры:
			| file                      | date       |
			| GeneratedTestFile_10.json | 29.02.2075 |
			| GeneratedTestFile_11.json | 31.04.2080 |
			| GeneratedTestFile_12.json | 50.01.2100 |
			| GeneratedTestFile_13.json | 12.13.2150 |
			| GeneratedTestFile_14.json | 00.01.2170 |
			| GeneratedTestFile_15.json | 05.00.2190 |
			| GeneratedTestFile_16.json |            |

	@card-delivery-replanning @negative
	Структура сценария: При изменении поля, отличного от даты, сервис не осуществляет перепланирование, а создает новое
		И данные пользователя подгружены из файла <file>
		Дано пользователь открыл главную страницу
		И загружена страница "Главная страница"
		Когда заполняются поля:
			| Город             | #{city}               |
			| Дата встречи      | #{now(dd.MM.yyyy)+3d} |
			| ФИО               | #{name}               |
			| Мобильный телефон | #{phone}              |
		И выполнено нажатие на Согласие на обработку данных
		И выполнено нажатие на Запланировать
		Тогда загружено диалоговое окно "Оповещение об успехе"
		И выполнено нажатие на Закрыть
		И загружена страница "Главная страница"
		И поле <field> заполняется значением <newValue>
		И выполнено нажатие на Запланировать
		И загружено диалоговое окно "Оповещение об успехе"
		И выполнено нажатие на Закрыть
		Примеры:
			| file                      | field             | newValue       |
			| GeneratedTestFile_17.json | Город             | #{secondCity}  |
			| GeneratedTestFile_18.json | ФИО               | #{secondName}  |
			| GeneratedTestFile_19.json | Мобильный телефон | #{secondPhone} |

	@card-delivery-replanning @negative
	Структура сценария: Перепланирование доставки карты не происходит, если снять чекбокс соглашения
		И данные пользователя подгружены из файла <file>
		Дано пользователь открыл главную страницу
		И загружена страница "Главная страница"
		Когда заполняются поля:
			| Город             | #{city}     |
			| Дата встречи      | <firstDate> |
			| ФИО               | #{name}     |
			| Мобильный телефон | #{phone}    |
		И выполнено нажатие на Согласие на обработку данных
		И выполнено нажатие на Запланировать
		Тогда загружено диалоговое окно "Оповещение об успехе"
		И выполнено нажатие на Закрыть
		И загружена страница "Главная страница"
		Когда поле Дата встречи заполняется значением <secondDate>
		И выполнено нажатие на Согласие на обработку данных
		И выполнено нажатие на Запланировать
		И поле Не принято соглашение видимо
		Примеры:
			| file                      | firstDate             | secondDate            |
			| GeneratedTestFile_20.json | #{now(dd.MM.yyyy)+3d} | #{now(dd.MM.yyyy)+4d} |

	@card-delivery-replanning @negative
	Структура сценария: Перепланирование доставки карты не происходит, если одно из полей, кроме даты, не заполнено
		И данные пользователя подгружены из файла <file>
		Дано пользователь открыл главную страницу
		И загружена страница "Главная страница"
		Когда заполняются поля:
			| Город             | #{city}               |
			| Дата встречи      | #{now(dd.MM.yyyy)+3d} |
			| ФИО               | #{name}               |
			| Мобильный телефон | #{phone}              |
		И выполнено нажатие на Согласие на обработку данных
		И выполнено нажатие на Запланировать
		Тогда загружено диалоговое окно "Оповещение об успехе"
		И выполнено нажатие на Закрыть
		И загружена страница "Главная страница"
		И поле <field> очищено
		И выполнено нажатие на Запланировать
		И поле <message> видимо
		Примеры:
			| file                      | field             | message             |
			| GeneratedTestFile_21.json | Город             | Не заполнен город   |
			| GeneratedTestFile_22.json | ФИО               | Не заполнено ФИО    |
			| GeneratedTestFile_23.json | Мобильный телефон | Не заполнен телефон |

	#todo добавить негатив на случай, если дата не изменилась (сейчас баг)
	#todo добавить негатив на случай ввода 1 слова в поле ФИО (сейчас баг)